{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from nltk.translate.bleu_score import corpus_bleu"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def failed_generation_index(dataset: pd.DataFrame):\n",
    "    return dataset.loc[dataset['has_error'] == True].index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_ref = pd.read_pickle(\"../outputs/finetune_dataset_test.pkl\")\n",
    "df_test = pd.read_parquet(\"../outputs/wikidatallm/results.parquet.gzip\")\n",
    "df_test_no_fail = df_test.drop(failed_generation_index(df_test))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.015460172168940916"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "corpus_bleu([[x.split()] for x in df_test_no_fail['target']], [x.split() for x in df_test_no_fail['translated_prompt']])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>row</th>\n",
       "      <th>last_executed_step</th>\n",
       "      <th>to_be_executed_step</th>\n",
       "      <th>translated_prompt</th>\n",
       "      <th>status</th>\n",
       "      <th>has_error</th>\n",
       "      <th>input</th>\n",
       "      <th>target</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2418</th>\n",
       "      <td>\"Can you find all cats with pictures and displ...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?cat ?catLabel ?image WHERE {\\n  ?cat w...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you find all cats with pictures and displ...</td>\n",
       "      <td>SELECT ?item ?itemLabel ?pic\\nWHERE\\n{\\n?item ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2419</th>\n",
       "      <td>\"Can you retrieve a list of people who are not...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?person ?personLabel ?personDescription...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you retrieve a list of people who are not...</td>\n",
       "      <td>SELECT ?person ?personLabel ?personDescription...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2420</th>\n",
       "      <td>\"Can you write a SparQL query to find the 50 l...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?word ?wordLabel WHERE {\\n  ?word wdt:P...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you write a SparQL query to find the 50 l...</td>\n",
       "      <td>SELECT ?id WHERE { ?lexeme [entity 0] ?id. } G...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2421</th>\n",
       "      <td>\"Can you find out where the authors of Wikimam...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?author ?authorLabel ?birthPlaceLabel W...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you find out where the authors of Wikimam...</td>\n",
       "      <td>SELECT ?livre ?livreLabel ?personneLabel ?lieu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2422</th>\n",
       "      <td>\"Can you find out how many online accounts are...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT (COUNT(DISTINCT ?person) AS ?count) WHE...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you find out how many online accounts are...</td>\n",
       "      <td>SELECT\\n?property\\n?propertyLabel\\n?count\\nWIT...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2837</th>\n",
       "      <td>\"Can you find me a list of French archivists w...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?archivist ?archivistLabel ?archivistPi...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you find me a list of French archivists w...</td>\n",
       "      <td>SELECT ?item ?itemLabel ?img ?occupation ?occu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2838</th>\n",
       "      <td>\"Can you write a SparQL query to display all h...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?hackerspace ?hackerspaceLabel ?locatio...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you write a SparQL query to display all h...</td>\n",
       "      <td>SELECT DISTINCT * WHERE {\\n?item [entity 0] [e...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2841</th>\n",
       "      <td>\"Can you create a timeline of pioneers of phot...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?person ?personLabel ?birthDate ?deathD...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you create a timeline of pioneers of phot...</td>\n",
       "      <td>SELECT DISTINCT ?wditem ?wditemLabel ?date ?im...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2842</th>\n",
       "      <td>\"Can you generate a query to find the most pop...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?tonality ?tonalityLabel ?work ?workLab...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you generate a query to find the most pop...</td>\n",
       "      <td>SELECT ?tonalityLabel (COUNT(?tonalityLabel) a...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2843</th>\n",
       "      <td>\"Can you find me a list of Chilean ministers w...</td>\n",
       "      <td>LLMTranslator</td>\n",
       "      <td></td>\n",
       "      <td>SELECT ?minister ?ministerLabel WHERE {\\n  ?mi...</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>\"Can you find me a list of Chilean ministers w...</td>\n",
       "      <td>SELECT distinct ?politician ?politicianLabel W...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>343 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    row last_executed_step  \\\n",
       "2418  \"Can you find all cats with pictures and displ...      LLMTranslator   \n",
       "2419  \"Can you retrieve a list of people who are not...      LLMTranslator   \n",
       "2420  \"Can you write a SparQL query to find the 50 l...      LLMTranslator   \n",
       "2421  \"Can you find out where the authors of Wikimam...      LLMTranslator   \n",
       "2422  \"Can you find out how many online accounts are...      LLMTranslator   \n",
       "...                                                 ...                ...   \n",
       "2837  \"Can you find me a list of French archivists w...      LLMTranslator   \n",
       "2838  \"Can you write a SparQL query to display all h...      LLMTranslator   \n",
       "2841  \"Can you create a timeline of pioneers of phot...      LLMTranslator   \n",
       "2842  \"Can you generate a query to find the most pop...      LLMTranslator   \n",
       "2843  \"Can you find me a list of Chilean ministers w...      LLMTranslator   \n",
       "\n",
       "     to_be_executed_step                                  translated_prompt  \\\n",
       "2418                      SELECT ?cat ?catLabel ?image WHERE {\\n  ?cat w...   \n",
       "2419                      SELECT ?person ?personLabel ?personDescription...   \n",
       "2420                      SELECT ?word ?wordLabel WHERE {\\n  ?word wdt:P...   \n",
       "2421                      SELECT ?author ?authorLabel ?birthPlaceLabel W...   \n",
       "2422                      SELECT (COUNT(DISTINCT ?person) AS ?count) WHE...   \n",
       "...                  ...                                                ...   \n",
       "2837                      SELECT ?archivist ?archivistLabel ?archivistPi...   \n",
       "2838                      SELECT ?hackerspace ?hackerspaceLabel ?locatio...   \n",
       "2841                      SELECT ?person ?personLabel ?birthDate ?deathD...   \n",
       "2842                      SELECT ?tonality ?tonalityLabel ?work ?workLab...   \n",
       "2843                      SELECT ?minister ?ministerLabel WHERE {\\n  ?mi...   \n",
       "\n",
       "     status  has_error                                              input  \\\n",
       "2418             False  \"Can you find all cats with pictures and displ...   \n",
       "2419             False  \"Can you retrieve a list of people who are not...   \n",
       "2420             False  \"Can you write a SparQL query to find the 50 l...   \n",
       "2421             False  \"Can you find out where the authors of Wikimam...   \n",
       "2422             False  \"Can you find out how many online accounts are...   \n",
       "...     ...        ...                                                ...   \n",
       "2837             False  \"Can you find me a list of French archivists w...   \n",
       "2838             False  \"Can you write a SparQL query to display all h...   \n",
       "2841             False  \"Can you create a timeline of pioneers of phot...   \n",
       "2842             False  \"Can you generate a query to find the most pop...   \n",
       "2843             False  \"Can you find me a list of Chilean ministers w...   \n",
       "\n",
       "                                                 target  \n",
       "2418  SELECT ?item ?itemLabel ?pic\\nWHERE\\n{\\n?item ...  \n",
       "2419  SELECT ?person ?personLabel ?personDescription...  \n",
       "2420  SELECT ?id WHERE { ?lexeme [entity 0] ?id. } G...  \n",
       "2421  SELECT ?livre ?livreLabel ?personneLabel ?lieu...  \n",
       "2422  SELECT\\n?property\\n?propertyLabel\\n?count\\nWIT...  \n",
       "...                                                 ...  \n",
       "2837  SELECT ?item ?itemLabel ?img ?occupation ?occu...  \n",
       "2838  SELECT DISTINCT * WHERE {\\n?item [entity 0] [e...  \n",
       "2841  SELECT DISTINCT ?wditem ?wditemLabel ?date ?im...  \n",
       "2842  SELECT ?tonalityLabel (COUNT(?tonalityLabel) a...  \n",
       "2843  SELECT distinct ?politician ?politicianLabel W...  \n",
       "\n",
       "[343 rows x 8 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_test_no_fail"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
